run/Leidenfrost/system/auxiliaryDicts/controlDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionPhaseChangeFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-10;;

deltaT          1e-11;

writeControl    adjustableRunTime;

writeInterval   1e-10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression false;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.1;
maxAlphaCo      0.1;
maxDeltaT       1;
maxDi           1;
maxCapillaryNum 1;

/*
libs
(
    libamrDynamicFvMesh.so
    libamrIndicators.so
    libamrCPULoad.so
    kahipDecomp.so
);
*/

libs
(
//    "libpostProcess.so"
    "libfluidThermo.so"
    "libdynamicLoadBalanceFvMesh.so" // All AMR and LB enhancements
);


functions
{}

// ************************************************************************* //
