run/Leidenfrost/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionPhaseChangeFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval   5e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression false;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       1;
maxDi           1;
maxCapillaryNum 1;

libs
(
    "libfluidThermo.so"
    "libdynamicLoadBalanceFvMesh.so" // All AMR and LB enhancements
);

/*
libs
(
    libamrDynamicFvMesh.so
    libamrIndicators.so
    libamrCPULoad.so
    kahipDecomp.so
);
*/

functions
{}

// ************************************************************************* //
