run/Leidenfrost/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-3;

vertices
(
    (0 1 0)			// point 0
    (4 1 0)			// point 1
    (4 5 0)			// point 2
    (0 5 0)			// point 3
    (0 1 4)			// point 4
    (4 1 4)			// point 5
    (4 5 4)			// point 6
    (0 5 4)			// point 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 40)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
		type	patch;
		faces
		(
			(1 2 6 5)
			(2 3 7 6)
      		(7 6 5 4)
		);
    }
    
    symmetry
    {
		type	symmetry;
		faces
		(
			(0 4 7 3)
			(3 2 1 0)
		);
    }

    fluid_to_solid
    {
    	type	wall;
    	faces
    	(
    		(0 1 5 4)
    	);
    }  
);

// ************************************************************************* //
