run/Leidenfrost/0.orig/fluid/T.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 370;

boundaryField
{
    atmosphere
    {
        type zeroGradient;
    }

    fluid_to_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 370;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              none;
        kappa           none;
    }
    
    symmetry
    {
        type symmetry;
    }
}

// ************************************************************************* //
