run/Leidenfrost/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;

    div(phi,alpha)                      Gauss vanLeer;
    div(phi,U)                          Gauss upwind;
    div(rhoPhi,U)                       Gauss upwind;
    div(phi,K)                          Gauss linear;
    div(phi,h)                          Gauss upwind;
    div(phi,k)                          Gauss upwind;
    div(phi,epsilon)                    Gauss upwind;
    div(phi,R)                          Gauss upwind;
    div(R)                              Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phiv,p)                         Gauss linear;
    div(phi,e)                          Gauss upwind;
    div(rhoCpLPhi,T.water)              Gauss upwind;
    div(rhoCpVPhi,T.air)                Gauss upwind;
}

laplacianSchemes
{
    default        Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    p_rgh;
    pcorr;
    alpha.water;
}

// ************************************************************************* //
