run/Leidenfrost/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.water
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
        cAlpha          1;

        MULESCorr       no;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        advectionScheme isoAdvection;
        reconstructionScheme plicRDF;
        vof2IsoTol      1e-8;
        surfCellTol     1e-6;
        snapTol         1e-10;
        writeVTK        true;
    }

    psiFinal
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-8;
        relTol           0;
    }

    rhoCpLFinal
    {
        solver           diagonal;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0;
    }

    rhoCpVFinal
    {
        solver           diagonal;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0;
    }

    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-8;
        relTol          0;
    }
    
    pcorr
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-08;
            relTol          0;
            smoother        DICGaussSeidel;
        }
        tolerance       1e-08;
        relTol          0;
    }
    
    pcorrFinal
    {
        
        $pcorr;
        tolerance       1e-08;
        relTol          0;
    }
    
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0;
        smoother         DIC;
    }
    
    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-8;
        relTol           0;
    }

    "(U|h|T.*|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|h|T.*|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-8;
        relTol           0;
    }
    
}

PIMPLE
{
    momentumPredictor true;
    nOuterCorrectors 1;
    nCorrectors 1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        "h.*"           1;
        "U.*"           1;
    }
}

// ************************************************************************* //
